results/routeA/transient_cfd_scaling_pilot/plain_20261006_0710/rank_12/case/system/decomposeParDict
FoamFile { format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains 12;
method scotch;
